
module.exports = {
  getCitys: getCitys
}


var list = [
  {
    "name": "北京",
    "sub": [
      {
        "name": "请选择"
      },
      {
        "name": "东城区"
      },
      {
        "name": "西城区"
      },
      {
        "name": "崇文区"
      },
      {
        "name": "宣武区"
      },
      {
        "name": "朝阳区"
      },
      {
        "name": "海淀区"
      },
      {
        "name": "丰台区"
      },
      {
        "name": "石景山区"
      },
      {
        "name": "房山区"
      },
      {
        "name": "通州区"
      },
      {
        "name": "顺义区"
      },
      {
        "name": "昌平区"
      },
      {
        "name": "大兴区"
      },
      {
        "name": "怀柔区"
      },
      {
        "name": "平谷区"
      },
      {
        "name": "门头沟区"
      },
      {
        "name": "密云县"
      },
      {
        "name": "延庆县"
      },
      {
        "name": "其他"
      }
    ],
    "type": 0
  },
  {
    "name": "广东",
    "sub": [
      {
        "name": "请选择",
        "sub": []
      },
      {
        "name": "广州",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "越秀区"
          },
          {
            "name": "荔湾区"
          },
          {
            "name": "海珠区"
          },
          {
            "name": "天河区"
          },
          {
            "name": "白云区"
          },
          {
            "name": "黄埔区"
          },
          {
            "name": "番禺区"
          },
          {
            "name": "花都区"
          },
          {
            "name": "南沙区"
          },
          {
            "name": "萝岗区"
          },
          {
            "name": "增城市"
          },
          {
            "name": "从化市"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "深圳",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "福田区"
          },
          {
            "name": "罗湖区"
          },
          {
            "name": "南山区"
          },
          {
            "name": "宝安区"
          },
          {
            "name": "龙岗区"
          },
          {
            "name": "盐田区"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "珠海",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "香洲区"
          },
          {
            "name": "斗门区"
          },
          {
            "name": "金湾区"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "汕头",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "金平区"
          },
          {
            "name": "濠江区"
          },
          {
            "name": "龙湖区"
          },
          {
            "name": "潮阳区"
          },
          {
            "name": "潮南区"
          },
          {
            "name": "澄海区"
          },
          {
            "name": "南澳县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "韶关",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "浈江区"
          },
          {
            "name": "武江区"
          },
          {
            "name": "曲江区"
          },
          {
            "name": "乐昌市"
          },
          {
            "name": "南雄市"
          },
          {
            "name": "始兴县"
          },
          {
            "name": "仁化县"
          },
          {
            "name": "翁源县"
          },
          {
            "name": "新丰县"
          },
          {
            "name": "乳源瑶族自治县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "佛山",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "禅城区"
          },
          {
            "name": "南海区"
          },
          {
            "name": "顺德区"
          },
          {
            "name": "三水区"
          },
          {
            "name": "高明区"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "江门",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "蓬江区"
          },
          {
            "name": "江海区"
          },
          {
            "name": "新会区"
          },
          {
            "name": "恩平市"
          },
          {
            "name": "台山市"
          },
          {
            "name": "开平市"
          },
          {
            "name": "鹤山市"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "湛江",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "赤坎区"
          },
          {
            "name": "霞山区"
          },
          {
            "name": "坡头区"
          },
          {
            "name": "麻章区"
          },
          {
            "name": "吴川市"
          },
          {
            "name": "廉江市"
          },
          {
            "name": "雷州市"
          },
          {
            "name": "遂溪县"
          },
          {
            "name": "徐闻县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "茂名",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "茂南区"
          },
          {
            "name": "茂港区"
          },
          {
            "name": "化州市"
          },
          {
            "name": "信宜市"
          },
          {
            "name": "高州市"
          },
          {
            "name": "电白县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "肇庆",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "端州区"
          },
          {
            "name": "鼎湖区"
          },
          {
            "name": "高要市"
          },
          {
            "name": "四会市"
          },
          {
            "name": "广宁县"
          },
          {
            "name": "怀集县"
          },
          {
            "name": "封开县"
          },
          {
            "name": "德庆县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "惠州",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "惠城区"
          },
          {
            "name": "惠阳区"
          },
          {
            "name": "博罗县"
          },
          {
            "name": "惠东县"
          },
          {
            "name": "龙门县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "梅州",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "梅江区"
          },
          {
            "name": "兴宁市"
          },
          {
            "name": "梅县"
          },
          {
            "name": "大埔县"
          },
          {
            "name": "丰顺县"
          },
          {
            "name": "五华县"
          },
          {
            "name": "平远县"
          },
          {
            "name": "蕉岭县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "汕尾",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "城区"
          },
          {
            "name": "陆丰市"
          },
          {
            "name": "海丰县"
          },
          {
            "name": "陆河县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "河源",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "源城区"
          },
          {
            "name": "紫金县"
          },
          {
            "name": "龙川县"
          },
          {
            "name": "连平县"
          },
          {
            "name": "和平县"
          },
          {
            "name": "东源县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "阳江",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "江城区"
          },
          {
            "name": "阳春市"
          },
          {
            "name": "阳西县"
          },
          {
            "name": "阳东县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "清远",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "清城区"
          },
          {
            "name": "英德市"
          },
          {
            "name": "连州市"
          },
          {
            "name": "佛冈县"
          },
          {
            "name": "阳山县"
          },
          {
            "name": "清新县"
          },
          {
            "name": "连山壮族瑶族自治县"
          },
          {
            "name": "连南瑶族自治县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "东莞",
        "sub": [],
        "type": 0
      },
      {
        "name": "中山",
        "sub": [],
        "type": 0
      },
      {
        "name": "潮州",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "湘桥区"
          },
          {
            "name": "潮安县"
          },
          {
            "name": "饶平县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "揭阳",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "榕城区"
          },
          {
            "name": "普宁市"
          },
          {
            "name": "揭东县"
          },
          {
            "name": "揭西县"
          },
          {
            "name": "惠来县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "云浮",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "云城区"
          },
          {
            "name": "罗定市"
          },
          {
            "name": "云安县"
          },
          {
            "name": "新兴县"
          },
          {
            "name": "郁南县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "其他"
      }
    ],
    "type": 1
  },
  {
    "name": "河北",
    "sub": [
      {
        "name": "请选择",
        "sub": [

        ]
      },
      {
        "name": "石家庄",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "长安区"
          },
          {
            "name": "桥东区"
          },
          {
            "name": "桥西区"
          },
          {
            "name": "新华区"
          },
          {
            "name": "裕华区"
          },
          {
            "name": "井陉矿区"
          },
          {
            "name": "鹿泉市"
          },
          {
            "name": "辛集市"
          },
          {
            "name": "藁城市"
          },
          {
            "name": "晋州市"
          },
          {
            "name": "新乐市"
          },
          {
            "name": "深泽县"
          },
          {
            "name": "无极县"
          },
          {
            "name": "赵县"
          },
          {
            "name": "灵寿县"
          },
          {
            "name": "高邑县"
          },
          {
            "name": "元氏县"
          },
          {
            "name": "赞皇县"
          },
          {
            "name": "平山县"
          },
          {
            "name": "井陉县"
          },
          {
            "name": "栾城县"
          },
          {
            "name": "正定县"
          },
          {
            "name": "行唐县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "唐山",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "路北区"
          },
          {
            "name": "路南区"
          },
          {
            "name": "古冶区"
          },
          {
            "name": "开平区"
          },
          {
            "name": "丰南区"
          },
          {
            "name": "丰润区"
          },
          {
            "name": "遵化市"
          },
          {
            "name": "迁安市"
          },
          {
            "name": "迁西县"
          },
          {
            "name": "滦南县"
          },
          {
            "name": "玉田县"
          },
          {
            "name": "唐海县"
          },
          {
            "name": "乐亭县"
          },
          {
            "name": "滦县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "秦皇岛",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "海港区"
          },
          {
            "name": "山海关区"
          },
          {
            "name": "北戴河区"
          },
          {
            "name": "昌黎县"
          },
          {
            "name": "抚宁县"
          },
          {
            "name": "卢龙县"
          },
          {
            "name": "青龙满族自治县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "邯郸",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "邯山区"
          },
          {
            "name": "丛台区"
          },
          {
            "name": "复兴区"
          },
          {
            "name": "峰峰矿区"
          },
          {
            "name": "武安市"
          },
          {
            "name": "邱县"
          },
          {
            "name": "大名县"
          },
          {
            "name": "魏县"
          },
          {
            "name": "曲周县"
          },
          {
            "name": "鸡泽县"
          },
          {
            "name": "肥乡县"
          },
          {
            "name": "广平县"
          },
          {
            "name": "成安县"
          },
          {
            "name": "临漳县"
          },
          {
            "name": "磁县"
          },
          {
            "name": "涉县"
          },
          {
            "name": "永年县"
          },
          {
            "name": "馆陶县"
          },
          {
            "name": "邯郸县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "邢台",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "桥东区"
          },
          {
            "name": "桥西区"
          },
          {
            "name": "南宫市"
          },
          {
            "name": "沙河市"
          },
          {
            "name": "临城县"
          },
          {
            "name": "内丘县"
          },
          {
            "name": "柏乡县"
          },
          {
            "name": "隆尧县"
          },
          {
            "name": "任县"
          },
          {
            "name": "南和县"
          },
          {
            "name": "宁晋县"
          },
          {
            "name": "巨鹿县"
          },
          {
            "name": "新河县"
          },
          {
            "name": "广宗县"
          },
          {
            "name": "平乡县"
          },
          {
            "name": "威县"
          },
          {
            "name": "清河县"
          },
          {
            "name": "临西县"
          },
          {
            "name": "邢台县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "保定",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "新市区"
          },
          {
            "name": "北市区"
          },
          {
            "name": "南市区"
          },
          {
            "name": "定州市"
          },
          {
            "name": "涿州市"
          },
          {
            "name": "安国市"
          },
          {
            "name": "高碑店市"
          },
          {
            "name": "易县"
          },
          {
            "name": "徐水县"
          },
          {
            "name": "涞源县"
          },
          {
            "name": "顺平县"
          },
          {
            "name": "唐县"
          },
          {
            "name": "望都县"
          },
          {
            "name": "涞水县"
          },
          {
            "name": "高阳县"
          },
          {
            "name": "安新县"
          },
          {
            "name": "雄县"
          },
          {
            "name": "容城县"
          },
          {
            "name": "蠡县"
          },
          {
            "name": "曲阳县"
          },
          {
            "name": "阜平县"
          },
          {
            "name": "博野县"
          },
          {
            "name": "满城县"
          },
          {
            "name": "清苑县"
          },
          {
            "name": "定兴县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "张家口",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "桥东区"
          },
          {
            "name": "桥西区"
          },
          {
            "name": "宣化区"
          },
          {
            "name": "下花园区"
          },
          {
            "name": "张北县"
          },
          {
            "name": "康保县"
          },
          {
            "name": "沽源县"
          },
          {
            "name": "尚义县"
          },
          {
            "name": "蔚县"
          },
          {
            "name": "阳原县"
          },
          {
            "name": "怀安县"
          },
          {
            "name": "万全县"
          },
          {
            "name": "怀来县"
          },
          {
            "name": "赤城县"
          },
          {
            "name": "崇礼县"
          },
          {
            "name": "宣化县"
          },
          {
            "name": "涿鹿县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "承德",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "双桥区"
          },
          {
            "name": "双滦区"
          },
          {
            "name": "鹰手营子矿区"
          },
          {
            "name": "兴隆县"
          },
          {
            "name": "平泉县"
          },
          {
            "name": "滦平县"
          },
          {
            "name": "隆化县"
          },
          {
            "name": "承德县"
          },
          {
            "name": "丰宁满族自治县"
          },
          {
            "name": "宽城满族自治县"
          },
          {
            "name": "围场满族蒙古族自治县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "沧州",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "新华区"
          },
          {
            "name": "运河区"
          },
          {
            "name": "泊头市"
          },
          {
            "name": "任丘市"
          },
          {
            "name": "黄骅市"
          },
          {
            "name": "河间市"
          },
          {
            "name": "献县"
          },
          {
            "name": "吴桥县"
          },
          {
            "name": "沧县"
          },
          {
            "name": "东光县"
          },
          {
            "name": "肃宁县"
          },
          {
            "name": "南皮县"
          },
          {
            "name": "盐山县"
          },
          {
            "name": "青县"
          },
          {
            "name": "海兴县"
          },
          {
            "name": "孟村回族自治县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "廊坊",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "安次区"
          },
          {
            "name": "广阳区"
          },
          {
            "name": "霸州市"
          },
          {
            "name": "三河市"
          },
          {
            "name": "香河县"
          },
          {
            "name": "永清县"
          },
          {
            "name": "固安县"
          },
          {
            "name": "文安县"
          },
          {
            "name": "大城县"
          },
          {
            "name": "大厂回族自治县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "衡水",
        "sub": [
          {
            "name": "请选择"
          },
          {
            "name": "桃城区"
          },
          {
            "name": "冀州市"
          },
          {
            "name": "深州市"
          },
          {
            "name": "枣强县"
          },
          {
            "name": "武邑县"
          },
          {
            "name": "武强县"
          },
          {
            "name": "饶阳县"
          },
          {
            "name": "安平县"
          },
          {
            "name": "故城县"
          },
          {
            "name": "景县"
          },
          {
            "name": "阜城县"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      {
        "name": "其他"
      }
    ],
    "type": 1
  }
]


function getCitys() {
  return list;
}